APITest_prueba/Result4/Report/Data/Step3.js

function _get_dyn_external_content_for_st(){return '<div><style>.basic-block table td.no-border{padding-left:0;}</style><div class="st-act-wrapper "><div class="block basic-block"><table><tr><td class="name col-head-style">Name</td><td class="name col-head-style">Step ID</td><td class="name col-head-style">Status</td><td class="name col-head-style">Message</td></tr><tr><td class="value col-head-style">CreateFlightOrder</td><td class="value col-head-style">StServiceCallActivity5</td><td class="value col-head-style">Failure</td><td class="value col-head-style">The server has returned a soap fault</td></tr></table></div><div class="block other-props-block"><div class="block-title">More</div><table><tr><td class="name row-head-style">InputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity5_InputXml_6e44167f-4273-4c87-a41c-e21809c528a6.xml\', \'Data/StServiceCallActivity5_InputXml_6e44167f-4273-4c87-a41c-e21809c528a6.js4hrpt\', \'.xml\', \'InputXml\');return false;">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;\r\n  &lt;Body&gt;\r\n    &lt;CreateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;\r\n      &lt;FlightOrder&gt;\r\n        &lt;Class&gt;Business&lt;/Class&gt;\r\n        &lt;CustomerName&gt;Fernando Hernandez&lt;/CustomerName&gt;\r\n        &lt;DepartureDate&gt;2020-05-15T00:00:00-06:00&lt;/DepartureDate&gt;\r\n        &lt;FlightNumber&gt;10638&lt;/FlightNumber&gt;\r\n        &lt;NumberOfTickets&gt;3&lt;/NumberOfTickets&gt;\r\n      &lt;/FlightOrder&gt;\r\n    &lt;/CreateFlightOrder&gt;\r\n  &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Service</td><td class="value row-head-style">Flights_Service</td></tr><tr><td class="name row-head-style">Port</td><td class="value row-head-style">FlightsServiceMethods</td></tr><tr><td class="name row-head-style">Operation</td><td class="value row-head-style">CreateFlightOrder</td></tr><tr><td class="name row-head-style">Address</td><td class="value row-head-style">http://localhost:8000/Flights_SOAP</td></tr><tr><td class="name row-head-style">SOAPAction</td><td class="value row-head-style">HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder</td></tr><tr><td class="name row-head-style">ContentType</td><td class="value row-head-style">text/xml; charset=utf-8</td></tr><tr><td class="name row-head-style">MessageExchangePattern</td><td class="value row-head-style">Request Response</td></tr><tr><td class="name row-head-style">Full request</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity5_Full_request_c8c9fbc2-9ee4-4e0d-9bf1-a5bd09d49a46.xml\', \'Data/StServiceCallActivity5_Full_request_c8c9fbc2-9ee4-4e0d-9bf1-a5bd09d49a46.js4hrpt\', \'.xml\', \'Full request\');return false;">&lt;Envelope xmlns="htt ... &lt;/Body&gt;\r\n&lt;/Envelope&gt;</a></td></tr><tr><td class="name row-head-style">InputHeader</td><td class="value row-head-style">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/CreateFlightOrder\nContent-Type:	text/xml; charset=utf-8\nHost:	localhost:8000\nContent-Length:	425\nExpect:	100-continue\nConnection:	Close\n</td></tr><tr><td class="name row-head-style">OutputHeader</td><td class="value row-head-style">Connection:	close\nContent-Length:	227\nContent-Type:	text/xml; charset=utf-8\nDate:	Fri, 15 May 2020 20:37:04 GMT\nServer:	Microsoft-HTTPAPI/2.0\n</td></tr><tr><td class="name row-head-style">OutputText</td><td class="value row-head-style">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;s:Fault&gt;&lt;faultcode&gt;s:Client&lt;/faultcode&gt;&lt;faultstring xml:lang="en-US"&gt;Specify a flight date later than today.&lt;/faultstring&gt;&lt;/s:Fault&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</td></tr><tr><td class="name row-head-style">HttpStatusCode</td><td class="value row-head-style">500 : InternalServerError</td></tr><tr><td class="name row-head-style">OutputXml</td><td class="value row-head-style"><a href="####" onclick="__uiElements.show_content_in_float_pane(\'Data/StServiceCallActivity5_OutputXml_5287e775-41e6-49ea-a0e3-f1b4b3746fa0.xml\', \'Data/StServiceCallActivity5_OutputXml_5287e775-41e6-49ea-a0e3-f1b4b3746fa0.js4hrpt\', \'.xml\', \'OutputXml\');return false;">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;\r\n  &lt;s:Body&gt;\r\n    &lt;s:Fault&gt;\r\n      &lt;faultcode&gt;s:Client&lt;/faultcode&gt;\r\n      &lt;faultstring xml:lang="en-US"&gt;Specify a flight date later than today.&lt;/faultstring&gt;\r\n    &lt;/s:Fault&gt;\r\n  &lt;/s:Body&gt;\r\n&lt;/s:Envelope&gt;</a></td></tr><tr><td class="name row-head-style">Details</td><td class="value row-head-style">CreateFlightOrder ended unsuccessfully</td></tr> </table></div></div>';}